# 판다스 데이터 입출력

In [32]:
import pandas as pd

## csv 파일 입력

In [33]:
# Magic 명령어
%%%writefile sample2.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample2.csv

In [34]:
pd.read_csv('sample2.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [35]:
# Magic 명령어
%%%writefile sample4.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample4.csv

In [36]:
pd.read_csv('sample4.csv')

   1   1.11     one
0  2   2.22     two
1  3   3.33   three

In [37]:
pd.read_csv('sample4.csv',header=None)

   0     1       2
0  1  1.11     one
1  2  2.22     two
2  3  3.33   three

In [38]:
pd.read_csv('sample4.csv', names=['c1', 'c2', 'c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [39]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [42]:
%%writefile sample6.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample6.txt

In [45]:
pd.read_table('sample6.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [54]:
%%writefile sample7.txt
파일 제목: sample7.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Overwriting sample7.txt

In [55]:
pd.read_csv('sample7.txt', skiprows=[0, 1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [56]:
%%writefile s5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing s5.csv

In [69]:
df = pd.read_csv('s5.csv', na_values=['누락', ' '])

In [70]:
df.to_csv('sample1.csv')

In [71]:
!cat sample1.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

In [72]:
df.to_csv('sample1.csv', sep='|', index=False)

In [73]:
!cat sample1.csv

c1| c2| c3
1.0|1.11| one
2.0|| two
|3.33| three

In [74]:
pd.read_csv('sample1.csv', sep='|')

    c1    c2      c3
0  1.0  1.11     one
1  2.0   NaN     two
2  NaN  3.33   three

In [75]:
# 인터넷 상의 csv 파일
df = pd.read_csv("https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv")

In [77]:
df.head(5)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]